tap "hashicorp/tap"
tap "terror/tap"
tap "texel-sensei/commit-lsp", "https://github.com/texel-sensei/commit-lsp"

brew "gh"
brew "antidote"
brew "yadm"

brew "helix", args: ["HEAD"]

brew "docker"
brew "docker-compose"
brew "docker-buildx"
brew "docker-credential-helper"
brew "colima", restart_service: :changed

brew "awscli"
brew "kubernetes-cli"

brew "just"

brew "uv"
brew "rustup"
brew "go"
brew "node"
brew "hashicorp/tap/terraform"

brew "jdtls"
brew "lua-language-server"
brew "docker-language-server"
brew "bash-language-server"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "yaml-language-server"
brew "terraform-ls"
brew "marksman"
brew "gopls"
brew "tombi"
brew "terror/tap/just-lsp"
brew "texlab"
brew "ty"
brew "ruff"
brew "rumdl"
brew "texel-sensei/commit-lsp/commit-lsp"
# TODO: actions-languageserver

brew "dockerfmt"
brew "gofumpt" # TODO: make gopls use this, remove if not required

# TODO: yaak/nexus?
brew "htmlq"
brew "jq"

brew "iamb"
brew "k9s"

# TODO: mactex, container
cask "ghostty@tip"
cask "claude-code"
