# Taps
tap "hashicorp/tap"
tap "terror/tap"

# Github
brew "gh"
# TODO: actions-languageserver

# zsh
brew "antidote"
brew "bash-language-server"

# Dotfiles
brew "yadm"

# Editor
brew "helix", args: ["HEAD"]

# Terminal emulator
cask "ghostty"

# Shell utilities
brew "jq"
brew "htmlq"
brew "tree"

# TODO: yaak/nexus?

# Containers
# TODO: cask "container"
brew "docker"
brew "docker-compose"
brew "docker-buildx"
brew "docker-credential-helper"
brew "colima"
brew "dockerfmt"
brew "docker-language-server"

# Terraform
brew "terraform"
brew "terraform-ls"

# AWS
brew "awscli"

# Kubernetes
brew "kubernetes-cli"
brew "k9s"

# C / C++
brew "meson"
brew "cmake"
brew "bear"

# Go
brew "go"
brew "gopls"
brew "gofumpt" # TODO: use this or check lsp config
brew "delve"
brew "protobuf"
brew "protoc-gen-go"

# Rust
brew "rustup"
brew "rust-analyzer"

# Python
brew "uv"
brew "ruff"
brew "ty"

# Web
brew "node"
brew "typescript-language-server"
brew "vscode-langservers-extracted" # HTML, CSS, JS, JSON

# YAML
brew "yaml-language-server"

# TOML
brew "tombi"

# Java
brew "jdtls"

# Lua
# TODO: lua interpreter or manager
brew "luarocks"
brew "lua-language-server"

# Markdown
brew "marksman"
brew "rumdl"

# LaTeX
cask "mactex"
brew "texlab"

# Just
# TODO: zsh completions not working
brew "just"
brew "just-lsp"
