# Taps
tap "hashicorp/tap", trusted: true
tap "terror/tap", trusted: true

# Github
brew "gh"
# TODO: actions-languageserver

# zsh
brew "antidote"
brew "bash-language-server"

# Dotfiles
brew "yadm"

# Editor
brew "helix", args: ["HEAD"]

# Terminal emulator
cask "ghostty"

# Shell utilities
brew "jq"
brew "htmlq"
brew "tree"

# TODO: yaak/nexus?

# Container
brew "container"

# Docker
brew "docker"
brew "docker-compose"
brew "docker-buildx"
brew "docker-credential-helper"
brew "colima"
brew "dockerfmt"
brew "docker-language-server"

# Terraform
brew "terraform"
brew "terraform-ls"
brew "helm"

# AWS
brew "awscli"

# Kubernetes
brew "kubernetes-cli"
brew "k9s"

# Go
brew "go"
brew "gopls"
brew "delve"
brew "go-air"
brew "gofumpt"
brew "golangci-lint"

# Git hooks
brew "pre-commit"

# Rust
brew "rustup"
brew "rust-analyzer"

# Zig
brew "zig"
brew "zls"

# Python
brew "uv"
brew "ruff"
brew "ty"

# JSON
brew "vscode-langservers-extracted"

# YAML
brew "yaml-language-server"

# TOML
brew "tombi"

# Lua
brew "lua-language-server"

# Markdown
brew "rumdl"

# LaTeX
cask "mactex"
brew "texlab"

# Just
brew "just"
brew "just-lsp"
